{
  "LEONINA71": {
    "apartment_id": "LEONINA71",
    "name": "Via Leonina 71",
    "address": "Via Leonina 71, Rome, Italy",

    "checkin_time": "15:00",
    "checkout_time": "11:00",

    "self_checkin_instructions": "Main building door: code 7171 + key symbol (or round key). Apartment door: use the long square-ended key; pull the heavy door towards you and turn counter-clockwise to open.",
    "checkout_instructions": "Please check out by 11:00. Leave the keys on the table, switch off AC, lights and hot plate, and close the door.",

    "wifi_ssid": "See router label on the back",
    "wifi_password": "See router label on the back",
    "wifi_note": "Router is on the table. If the connection is slow: toggle Wi-Fi on your phone; power-cycle the router (off 10s → on) and wait 2–3 minutes.",

    "water_note": "Cold water is drinkable. Hot water should always be available.",
    "boiler_warning": "Please do NOT touch the switch on the left side of the bathroom mirror (it controls the hot water).",
    "boiler_reset_steps": "Run the tap 30–60s; check the boiler light is on. If problems persist, contact the host.",
    "plumber_phone": "+39 335 5245756",

    "bathroom_amenities": "Hairdryer, bath mat, toilet paper, hand soap.",
    "towels_note": "Beds are made. Each guest has 1 large, 1 medium, 1 small towel.",

    "lighting_kitchen": "Switch is on the right side of the stairs (facing the kitchen).",
    "lighting_terrace": "Switch is inside the apartment, on the right before exiting to the terrace.",

    "appliance_notes": "AC: turn off when leaving (eco 23–24°C). Electric hot plate: switch off after use; never leave pots unattended. Terrace umbrella: tie to railing and ALWAYS close when away (wind risk!). Washer/Dishwasher: prefer eco cycles.",
    "plants_note": "If you like, feel free to water the plants daily (except cacti).",

    "trash_rules": "Use the courtyard bins; separate glass, plastic/metal and paper as posted. General waste daily.",

    "emergency_contacts": "Emergency 112; Host +39 335 5245756.",
    "host_phone": "+39 335 5245756",

    "map_link": "https://maps.google.com/?q=Via+Leonina+71+Rome",
    "neighborhood_tips_link": "https://niceflatinrome.com/leonina-guide",

    "eat_recommendations": "Nearby: La Taverna dei Fori Imperiali (Via della Madonna dei Monti 9, +39 06 679 8643) — classic Roman trattoria. Ai Tre Scalini (Via Panisperna 251, +39 06 4890 7495) — historic wine bar with small plates. Blackmarket Hall (Via Panisperna 101) — cocktails. La Barrique (Via del Boschetto 41) — cozy wine bar.",
    "drink_recommendations": "Blackmarket Hall (cocktails, Via Panisperna 101). La Barrique (wine bar, Via del Boschetto 41). Piazza Madonna dei Monti for aperitivo.",
    "shopping_tips": "Mercato Monti (weekend vintage & designers, Via Leonina 46). Via del Boschetto & Via Urbana: artisanal boutiques and leather goods.",
    "visit_highlights": "Colosseum (10 min), Roman Forum (12 min), San Pietro in Vincoli (Michelangelo’s Moses). Hidden gems: Santa Prassede mosaics; Scalinata dei Borgia; underground of San Martino ai Monti (guided).",
    "useful_numbers": "Emergency 112 • Police 113 • Ambulance 118 • Fire 115 • Taxi 06 3570 • City info 06 0606."
  }
}
